title: Stage Popular Credential Files for Exfiltration
id: da3ca2ad-c451-43ce-a471-bbba128ed4f1
description: Browser credential files (Firefox, Chrome, Opera, and Edge) were searched via PowerShell for possible exfiltration.
references:
    - https://attack.mitre.org/techniques/T1555/003/
author: Trend Micro
date: 2023/04/26
tags:
    - attack.t1555.003
logsource:
    product: windows
    definition: TELEMETRY_AMSI
detection:
    selection:
        eventSubId: TELEMETRY_AMSI_EXECUTE
        objectAppName: '*PowerShell*'
    firefox_loc:
        processCmd:
            - '*\Mozilla\Firefox\Profiles\*'
            - '*.default-release*'
    cred_chrome:
        processCmd: '*\Google\Chrome\User Data\Default\Login Data*'
    cred_opera:
        processCmd: '*\Opera Software\Opera Stable\Login Data*'
    cred_edge:
        processCmd: '*\Microsoft\Edge\User Data\Default\Login Data*'
    keyword1:
        processCmd: '*\key4.db*'
    keyword2:
        processCmd: '*\logins.json*'
    condition: selection and (firefox_loc and 1 of keyword* or 1 of cred*)
level: high
