title: Possible Credential Dumping via PowerShell - Windows Event Log
id: 848a233c-2886-4c7e-9523-f92d28335845
description: Credential dumping command was observed on the endpoint.
references:
    - https://attack.mitre.org/techniques/T1003/
    - https://attack.mitre.org/techniques/T1059/001/
author: Trend Micro
date: 2022/08/17
tags:
    - attack.t1003
    - attack.t1059.001
logsource:
    product: windows
    definition: TELEMETRY_WINDOWS_EVENT
detection:
    eventId:
        winEventId: 4104
    selection:
        eventDataScriptBlockText:
            - '*mimikatz*'
            - '*sekurlsa::*'
            - '*kerberos::*'
            - '*lsadump::*'
            - '*privilege::*'
            - '*mimi.ps1*'
            - '*mimikitt.ps1*'
            - '*Invoke-Mimikittenz.ps1*'
            - '*pwdump*'
            - '*gsecdump*'
            - '*secretsdump*'
            - '*hashdump*'
            - '*Invoke-DcSyncHashDump*'
            - '*Out-Minidump*'
    condition: eventId and selection
level: high
